<?php

namespace App\Exceptions\Library;

class Success
{
    public static function Code($code)
    {
        $maps = static::Msg();
        return $maps[$code] ?? '请求成功';
    }

    public static function Msg()
    {
        return [
            '20000' => '请求成功',
            '20001' => '创建成功',
            '20002' => '修改成功',
            '20003' => '删除成功',
            '20004' => '上传成功',
            '20005' => '处理成功',
            '20006' => '申请成功',
            '20007' => '购买成功',
            '20008' => '退出成功',
            '20009' => '暂无新版本',
            '20010' => '转账成功',
            '21000' => '充值成功',
            '21001' => '新增任务成功',
            '21002' => '重新提交成功',
            '21003' => '当前级别已为最高级别',
            '22001' => '存在新版本',
        ];
    }
}
