<?php

namespace App\Exceptions\Library;

class Valid
{
    public static function Code($code)
    {
        $maps = static::Msg();
        return $maps[$code] ?? '验证失败';
    }

    public static function Msg()
    {
        return [
            '60002' => '数据验证--失败',
            '60003' => '数据类型--错误',
            '60004' => '数据验证--已存在',
            '60006' => '数据验证失败--版本错误',
            '60007' => '暂无权限',
            '60008' => '版本验证失败--参数错误',
            '60009' => '链接解析错误--请重试',
            '60013' => '账户余额不足--请充值',
            '60014' => '购买会员条件不足',
            '60015' => '支付方式配置错误',
            '60016' => '默认对接,通知配置未开启',
            '60021' => '缺少参数',

            '61001' => '图片文件不存在',
            '61002' => '图片类型错误',
            '61003' => '图片大小限制10M',
            '61004' => '安装包文件不存在',
            '61005' => '文件大小超过100M',

            '62001' => '已发布的最新版本,禁止修改和删除',
            '62002' => '服务链接超时,或该商品不存在',
            '62003' => '该商品存在其他参数,请核实',

            '63001' => '提现金额--最低提现金额错误',
            '63002' => '提现金额--提现基数错误',
            '63003' => '提现金额--可提现佣金不足',
            '63004' => '提现金额--请请输入正确的卡号',

            '64001' => '更改上级失败,数据验证失败',
        ];
    }
}
